[
    {
        "image": "IMG_9932.png",
        "text": ""
    },
    {
        "image": "MVP305.png",
        "text": "<p><span class='large-text'>At Morehouse College, each department is vital</span> to our students' transformative journeys. From sparking high school students' aspirations to ongoing support that propels our graduates into thriving careers, each department is interconnected and indispensable. Admissions, academics, student affairs, business & finance, operations & administrative services, marketing, external relations, and alumni engagement collaborate to sculpt the renowned “Morehouse Experience.”</p>"
    },
    {
        "image": "5B8A0081.png",
        "text": "<p><span class='large-text'>Understanding how individual roles serve</span> the collective mission and goals helps us guide high school recruits and transform them into competent, compassionate alumni who go on to make significant contributions in the world. See how your work contributes to Morehouse's success and ensures that the impact of our institution resonates far beyond the classroom and our campus.</p>"
    },
    {
        "image": "5B8A0020.png",
        "text": "<h3>Delivering the Morehouse Experience</h3><p><b>Enrollment:</b> Students learn what to expect of Morehouse from their recruitment, admissions, and enrollment experience. This period sets the bar that the College must continue to maintain or aim to improve upon for the next 4 years and beyond. Here, we must provide an easy, seamless experience for prospective students and their loved ones at one of the most pivotal transition stages in a young life.</p>"
    },
    {
        "image": "5B8A0398.png",
        "text": "<h3>Delivering the Morehouse Experience</h3><p><b>In and out of the classroom:</b> At Morehouse, we foster rigorous, intellectually stimulating academic curricula while providing the extracurricular experiences &mdash; both domestic and abroad &mdash; that develop the character, mold the critical thinking skills, and deepen the sense of compassion and responsibility that men of Morehouse have for their communities, the world, and themselves.</p>"
    },
    {
        "image": "MVP083.png",
        "text": "<h3>Delivering the Morehouse Experience</h3><p><b>Student Success:</b> Morehouse was designed to be a haven for the nurturing, education, and development of Black men - innately creating an environment for student success. Building this environment in a world where the opposite is most prevalent enables men of Morehouse to engage at more profound, intentional, and holistic levels. The House is our students' home. By partnering with parents and alumni, we continue to support their growth, learning, development, safety, and comfort.</p>"
    },
    {
        "image": "CCC_7512.png",
        "text": "<h3>Delivering the Morehouse Experience</h3><p><b>Student & Employee Service:</b> Our unwavering commitment to delivering an exceptional student and employee experience is ingrained in our institutional ethos. We operate as a unified force, prioritizing the needs of students, faculty, staff, and the institution in every decision made. This collective dedication ensures a seamless and supportive environment where every member of the Morehouse community feels valued. We don't just provide education; we create a home, fostering a sense of belonging and warmth that extends beyond academics to encompass the overall well-being of our community.</p>"
    },
    {
        "image": "MVP040.png",
        "text": "<h3>Delivering the Morehouse Experience</h3><p><b>Institution Success:</b> To last another 157 years, Morehouse College will thrive on its invested commitment to developing capable, inclusive teams; encouraging innovation and collaboration; investing in cutting-edge technology; employing sound financial strategies; and enacting data-driven decision-making. The institution holds itself accountable for creating an environment where every member of the Morehouse community has the tools and support needed to achieve their highest potential aligned with the College's strategic plan.</p>"
    },
    {
        "image": "Group_7.png",
        "text": "<h3>Delivering the Morehouse Experience</h3><p><b>Transition:</b> Morehouse produces Black men nurtured and trained to consider the world beyond themselves. As they graduate from being men of Morehouse to Morehouse Men, they are known &mdash; and proven &mdash; to be not only competent in their knowledge and skills but are also called to make a profound impact in their professional industries, communities, and the world at large, while staying connected to Morehouse to ensure the next generation of Morehouse improves upon this incomparable legacy.</p>"
    },
    {
        "image": "IMG_9912.png",
        "text": "<p><span class='large-text'>As we embark on the next 157 years at Morehouse College,</span> we celebrate the collaborative tapestry that shapes the world-renowned “Morehouse Experience.” Each department plays a vital role in a man of Morehouse's transformative journey, from the initial spark during the recruitment process to the ongoing support that propels our graduates into thriving careers, forever bonding them as engaged and invested alumni. Morehouse College stands poised to ascend alumnus Dr. Martin Luther King Jr.'s allegorical “mountain top,” driven by our collective dedication and accountability to excellence, inclusivity, innovation, and the enduring legacy of producing impactful leaders known as Morehouse Men.</p>"
    }
]
